#+TITLE: Building a web client and server
#+AUTHOR: Marcus Birkenkrahe & ChatGPT (pledged)
#+OPTIONS: toc:nil num:nil
#+STARTUP: overview hideblocks indent
#+properties: header-args:C :main no :includes :results output :exports both
* Forking processes

- On Unix-based systems, starting a new process is easy using the ~fork~
  function to create a child process. Each child process has its own
  memory space, and each client is handled in a separate process.

- From ~man fork(2)~: Returns a unique new process ID (PID).
  #+begin_example C
  pid_t fork(void);
  #+end_example

- Here is how it works:
  #+begin_src C :main no :includes :results output
    #include <stdio.h>  // for input/output
    #include <unistd.h> // to close sockets
    #include <errno.h>  // perror and errno

    int main(void)
    {
      pid_t pid = fork(); // create a new process

      if (pid == 0) { //
        // child process
        printf("Hello from child (PID: %d)\n", getpid());
      } else if (pid > 0) {
        // parent process
        printf("Hello from parent (PID: %d, child PID: %d)\n", getpid(), pid);
      } else {
        // fork failed
        perror("fork failed");
      }
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello from parent (PID: 1239813, child PID: 1239814)
  : Hello from child (PID: 1239814)

- ~fork~ returns 0 in the child process, and a positive number (child's
  PID) in the parent process, and -1 if the fork fails.

- You can create a *fork bomb* if you're not careful by forking in an
  infinite loop. If you try this, you should set a process limit first
  with ~ulimit -u 100~.

- Check the current limit:
  #+begin_src bash :results output :exports both
    ulimit -u
  #+end_src

  #+RESULTS:
  : 255424

- Similar to process forking is *multithreading*: here, a new thread
  within the same process is created using ~pthread_createe(3)~. Threads
  share the same address space - more scalable for large number of
  connections.

- To learn more about this, take the Operating Systems course (CSC
  420) where we talk about process management.

* NEXT Compile and test TCP client

1) Tangle =tcp_client.c= (or download from: [[https://tinyurl.com/tcp-client-full][tinyurl.com/tcp-client-full]])

2) Build the complete program

   #+begin_src bash :results output :exports both
     make tcp_client
   #+end_src

   #+RESULTS:
   : make: 'tcp_client' is up to date.

3) Test with ~example.com~ on port ~80~ (http): Run the client to connect
   to ~example.com~ on port ~http~ (port 80):
   #+begin_src bash :results output :exports both
     ./tcp_client example.com http
   #+end_src

4) Send an HTTP GET Request: After the client prints "Connected." and
   "To send data, enter text followed by enter.", type the following
   HTTP GET request (press Enter after each line, and twice after the
   last line):
   #+begin_src bash :results output :exports both
     GET / HTTP/1.1
     Host: example.com
   #+end_src
   - This sends a request to ~example.com~ to retrieve its homepage.

5) Expected Output: After sending the request
   #+begin_example
       Sending: GET / HTTP/1.1\n
       Sent 16 bytes.
       Sending: Host: example.com\n
       Sent 18 bytes.
       Sending: \n
       Sent 1 bytes.
       Received (... bytes): HTTP/1.1 200 OK...
       [HTML content from example.com]
   #+end_example

   - The client prints the server’s response, including HTTP headers
     and the webpage’s HTML.

   - Note: ~example.com~ may close the connection after responding:
     #+begin_example
     "Connection closed by peer.", "Closing socket...", "Finished.".
     #+end_example
 
6) Close connection with CTRL+D (EOF) to exit.

